#include"allocateAndclear.h"
template <typename T>
T** allocate(unsigned int rows, unsigned int cols)
{
	/////////////////////////////////////////////////////////////////////////////
	//////////////     ќбъ€вление двумерного динамического массива:      ////////
	/////////////////////////////////////////////////////////////////////////////
	//1) ќбъ€вл€ем указатель на указатель, и сохран€ем в него адрес массива указателей
	T** arr = new T * [rows];
	//2) —оздаЄм строки двумерного динамического массива:
	for (int i = 0; i < rows; i++)
	{
		arr[i] = new T[cols]{};
	}
	return arr;
}
template <typename T>
void clear(T** arr, const unsigned int rows)
{
	/////////////////////////////////////////////////////////////////////////////
	////////         ”даление двумерного динамического массива:          ////////
	/////////////////////////////////////////////////////////////////////////////
	//1) ”дал€ем строки:
	for (int i = 0; i < rows; i++)
	{
		delete arr[i];
	}
	//2) ”дал€ем массив указателей:
	delete[] arr;
}