#include"allocateAndclear.h"
template <typename T>
T** allocate(unsigned int rows, unsigned int cols)
{
	/////////////////////////////////////////////////////////////////////////////
	//////////////     Объявление двумерного динамического массива:      ////////
	/////////////////////////////////////////////////////////////////////////////
	//1) Объявляем указатель на указатель, и сохраняем в него адрес массива указателей
	T** arr = new T * [rows];
	//2) Создаём строки двумерного динамического массива:
	for (int i = 0; i < rows; i++)
	{
		arr[i] = new T[cols]{};
	}
	return arr;
}
template <typename T>
void clear(T** arr, const unsigned int rows)
{
	/////////////////////////////////////////////////////////////////////////////
	////////         Удаление двумерного динамического массива:          ////////
	/////////////////////////////////////////////////////////////////////////////
	//1) Удаляем строки:
	for (int i = 0; i < rows; i++)
	{
		delete arr[i];
	}
	//2) Удаляем массив указателей:
	delete[] arr;
}